import pandas as pd

df1 = pd.DataFrame({
    '매출':[10000000,12000000,9000000,6000000,8000000,11000000],
    '비용':[15000000,13000000,12000000,9000000,9900000,9500000]},
index=['1월','2월','3월','4월','5월','6월'])
df1['이익'] = df1['매출']-df1['비용']
print(df1)
print()

df2 = pd.DataFrame({
    '매출':[13000000,14000000,17000000,15400000,16500000,16600000],
    '비용':[11000000,10400000,11000000,12100000,9000000,9500000]},
index=['7월','8월','9월','10월','11월','12월'])
df2['이익'] = df2['매출']-df2['비용']
print(df2)
print()

df3 = pd.concat([df1,df2],axis=0)
print(df3)

df3.loc['총 실적'] = df3.sum(axis=0)
print(df3)